[Killed] LogicalOperator
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:25:14
     return (
         <Form onSubmit={handleSubmit(submitAction)}>
 
-            {initialContents && (
-                <Form.Group className="mb-3" >
-                    <Form.Label htmlFor="id">id</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-id"}
-                        id="id"
-                        type="text"
-                        {...register("id")}
-                        value={initialContents.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {initialContents || <Form.Group className="mb-3">
+                    <Form.Label htmlFor="id">id</Form.Label>
+                    <Form.Control data-testid={testIdPrefix + "-id"} id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+                </Form.Group>}
 
             <Form.Group className="mb-3" >
killedBy: UCSBDiningCommonsMenuItemForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:25:14
     return (
         <Form onSubmit={handleSubmit(submitAction)}>
 
-            {initialContents && (
-                <Form.Group className="mb-3" >
-                    <Form.Label htmlFor="id">id</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-id"}
-                        id="id"
-                        type="text"
-                        {...register("id")}
-                        value={initialContents.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {true}
 
             <Form.Group className="mb-3" >
killedBy: UCSBDiningCommonsMenuItemForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemForm-id"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:66:55
                     id="diningCommonsCode"
                     type="text"
                     isInvalid={Boolean(errors.diningCommonsCode)}
-                    {...register("diningCommonsCode", {
-                        required: "diningCommonsCode is required."
-                    })}
+                    {...register("diningCommonsCode", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: UCSBDiningCommonsMenuItemForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /diningCommonsCode is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:82:34
                     id="station"
                     type="text"
                     isInvalid={Boolean(errors.station)}
-                    {...register("station", {
+                    {...register("", {
                         required: "station is required."
                     })}
killedBy: UCSBDiningCommonsMenuItemForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
