[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:7:20
 import AppNavbarLocalhost from "main/components/Nav/AppNavbarLocalhost"
 
 export default function AppNavbar({ currentUser, systemInfo, doLogout, currentUrl = window.location.href }) {
-  var oauthLogin = systemInfo?.oauthLogin || "/oauth2/authorization/google";
+  var oauthLogin = true;
   return (
     <>
killedBy: AppNavbar tests when oauthlogin undefined, default value is used
statusReason: Error: expect(element).toHaveAttribute("href", "/oauth2/authorization/google") // element.getAttribute("href") === "/oauth2/authorization/google"

Expected the element to have attribute:
  href="/oauth2/authorization/google"
Received:
  null

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:7:20
 import AppNavbarLocalhost from "main/components/Nav/AppNavbarLocalhost"
 
 export default function AppNavbar({ currentUser, systemInfo, doLogout, currentUrl = window.location.href }) {
-  var oauthLogin = systemInfo?.oauthLogin || "/oauth2/authorization/google";
+  var oauthLogin = systemInfo?.oauthLogin && "/oauth2/authorization/google";
   return (
     <>
killedBy: AppNavbar tests when oauthlogin undefined, default value is used
statusReason: Error: expect(element).toHaveAttribute("href", "/oauth2/authorization/google") // element.getAttribute("href") === "/oauth2/authorization/google"

Expected the element to have attribute:
  href="/oauth2/authorization/google"
Received:
  null

[Killed] MethodExpression
main/components/Nav/AppNavbar.js:11:10
   return (
     <>
       {
-        (currentUrl.startsWith("http://localhost:3000") ||
+        (currentUrl.endsWith("http://localhost:3000") ||
           currentUrl.startsWith("http://127.0.0.1:3000")) && (
           <AppNavbarLocalhost url={currentUrl} />
killedBy: AppNavbar tests renders the AppNavbarLocalhost when on http://localhost:3000
statusReason: Error: Unable to find an element by: [data-testid="AppNavbarLocalhost"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] StringLiteral
main/components/Nav/AppNavbar.js:12:33
     <>
       {
         (currentUrl.startsWith("http://localhost:3000") ||
-          currentUrl.startsWith("http://127.0.0.1:3000")) && (
+          currentUrl.startsWith("")) && (
           <AppNavbarLocalhost url={currentUrl} />
         )
killedBy: AppNavbar tests does NOT render the AppNavbarLocalhost when on localhost:8080
statusReason: Error: expect(received).toBeNull()

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:48:17
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_ADMIN") && (
-                  <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown" >
-                    <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                hasRole(currentUser, "ROLE_ADMIN") || <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown">
+                    <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
+                  </NavDropdown>
               }
             </Nav>
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:56:15
               }
             </Nav>
             {
-              currentUser && currentUser.loggedIn && (
+              currentUser || currentUser.loggedIn && (
                 <>
                   <Nav.Link as={Link} to="/restaurants">Restaurants</Nav.Link>
killedBy: AppNavbar tests Restaurant and UCSBDates links do NOT show when not logged in
statusReason: TypeError: Cannot read properties of null (reading 'loggedIn')
