[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.js:88:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.inactive?.message && 'inactive is required. '}
+                    {false}
                     {'The input should be just true or false'}
                 </Form.Control.Feedback>
killedBy: UCSBOrganizationForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /inactive is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.js:88:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.inactive?.message && 'inactive is required. '}
+                    {true}
                     {'The input should be just true or false'}
                 </Form.Control.Feedback>
killedBy: UCSBOrganizationForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /inactive is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:89:22
                 />
                 <Form.Control.Feedback type="invalid">
                     {errors.inactive?.message && 'inactive is required. '}
-                    {'The input should be just true or false'}
+                    {""}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: UCSBOrganizationForm tests Correct Error message on wrong inactive input
statusReason: Error: Unable to find an element with the text: The input should be just true or false. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:96:45
 
             <Button
                 type="submit"
-                data-testid={testIdPrefix + "-submit"}
+                data-testid={testIdPrefix + ""}
             >
                 {buttonLabel}
killedBy: UCSBOrganizationForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBOrganizationForm-submit"]

<body>
  <div>
    <form
      class=""
    >
      <div
