[Killed] BlockStatement
main/components/UCSBOrganization/UCSBOrganizationTable.js:13:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/ucsborganizations/edit/${cell.row.values.orgCode}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: UCSBOrganizationTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ucsborganizations/edit/DSP"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:32:21
 
     const columns = [
         {
-            Header: 'orgCode',
+            Header: "",
             accessor: 'orgCode', // accessor is the "key" in the data
         },
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: orgCode. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:33:23
     const columns = [
         {
             Header: 'orgCode',
-            accessor: 'orgCode', // accessor is the "key" in the data
+            accessor: "", // accessor is the "key" in the data
         },
         {
killedBy: UCSBOrganizationTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  DSP
Received:

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:41:23
         },
         {
             Header: 'orgTranslation',
-            accessor: 'orgTranslation',
+            accessor: "",
         },
         {
killedBy: UCSBOrganizationTable tests Delete button calls delete callback
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Delta Sigma Pi
Received:

[Killed] ArrowFunction
main/components/UCSBOrganization/UCSBOrganizationTable.js:45:23
         },
         {
             Header: 'inactive',
-            accessor: (row, _rowIndex) => String(row.inactive)
+            accessor: () => undefined
         }
     ];
killedBy: UCSBOrganizationTable tests Delete button calls delete callback
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:

[Killed] BlockStatement
main/components/UCSBOrganization/UCSBOrganizationTable.js:49:45
         }
     ];
 
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "UCSBOrganizationTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "UCSBOrganizationTable"));
-    } 
+    if (hasRole(currentUser, "ROLE_ADMIN")) {} 
 
     return <OurTable
killedBy: UCSBOrganizationTable tests Has the expected column headers and content for an adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:50:43
     ];
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "UCSBOrganizationTable"));
+        columns.push(ButtonColumn("Edit", "", editCallback, "UCSBOrganizationTable"));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "UCSBOrganizationTable"));
     } 
killedBy: UCSBOrganizationTable tests Has the expected column headers and content for an adminUser
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:51:71
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, "UCSBOrganizationTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "UCSBOrganizationTable"));
+        columns.push(ButtonColumn("Delete", "danger", deleteCallback, ""));
     } 
 
killedBy: UCSBOrganizationTable tests Has the expected column headers and content for an adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-Delete-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:57:17
     return <OurTable
         data={organizations}
         columns={columns}
-        testid={"UCSBOrganizationTable"}
+        testid={""}
     />;
 };
killedBy: UCSBOrganizationTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-orgCode"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
