[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:38:9
             accessor: 'id', // accessor is the "key" in the data
         },
 
-        {
-            Header: 'name',
-            accessor: 'name',
-        },
+        {},
         {
             Header: 'diningCommonsCode',
killedBy: UCSBDiningCommonsMenuItemTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:39:21
         },
 
         {
-            Header: 'name',
+            Header: "",
             accessor: 'name',
         },
killedBy: UCSBDiningCommonsMenuItemTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: name. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:40:23
 
         {
             Header: 'name',
-            accessor: 'name',
+            accessor: "",
         },
         {
killedBy: UCSBDiningCommonsMenuItemTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Tofu Banh Mi Sandwich (v)
Received:

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:42:9
             Header: 'name',
             accessor: 'name',
         },
-        {
-            Header: 'diningCommonsCode',
-            accessor: 'diningCommonsCode',
-        },
+        {},
         {
             Header: 'station',
killedBy: UCSBDiningCommonsMenuItemTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:44:23
         },
         {
             Header: 'diningCommonsCode',
-            accessor: 'diningCommonsCode',
+            accessor: "",
         },
         {
killedBy: UCSBDiningCommonsMenuItemTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Ortega
Received:
